-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Окт 06 2021 г., 13:45
-- Версия сервера: 10.4.21-MariaDB
-- Версия PHP: 7.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `chat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `msg_id` int(11) NOT NULL,
  `incoming_msg_id` int(255) NOT NULL,
  `outgoing_msg_id` int(255) NOT NULL,
  `msg` varchar(1000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`msg_id`, `incoming_msg_id`, `outgoing_msg_id`, `msg`) VALUES
(25, 1225813584, 701603936, 'привет'),
(26, 701603936, 1225813584, 'привет)'),
(27, 701603936, 575497710, 'еще одна проверка'),
(28, 575497710, 701603936, 'проверка отправления'),
(29, 575497710, 701603936, 'sdjhfbksdj'),
(30, 701603936, 575497710, 'fdhubdu'),
(31, 575497710, 701603936, 'ye b ye'),
(32, 575497710, 701603936, 'а можно по русски'),
(33, 701603936, 575497710, 'а как на ентр нажимать'),
(34, 575497710, 701603936, 'раппап'),
(35, 701603936, 575497710, 'проверка'),
(36, 575497710, 701603936, 'он не в ту сторону воюет'),
(37, 575497710, 701603936, 'опа'),
(38, 575497710, 701603936, 'хехе, починил'),
(39, 575497710, 701603936, 'йо, класс'),
(40, 575497710, 701603936, 'отправляется'),
(41, 575497710, 701603936, 'проверка'),
(42, 575497710, 701603936, 'ват мва'),
(43, 575497710, 701603936, 'амвамва'),
(44, 575497710, 701603936, 'да кааак'),
(45, 701603936, 1225813584, 'проверка длинного сообщения проверка длинного сообщения проверка длинного сообщения проверка длинного сообщения проверка длинного сообщения проверка длинного сообщения проверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщенияпроверка длинного сообщения'),
(46, 701603936, 1225813584, 'такааааааааааааккакакакакака'),
(47, 701603936, 1225813584, 'абоаобаоао');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`msg_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `msg_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
